Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: There's actually another blktrace command that implements the above pipeline as a single command, so the user doesn't have to bother typing in the above command sequence::
it_it: Esiste in realtà un altro comando blktrace che implementa la pipeline descritta sopra come un singolo comando, quindi l'utente non deve preoccuparsi di digitare la sequenza di comandi precedente::

source: There's also a nice perf tutorial on the perf wiki that goes into more detail than we do here in certain areas: `perf Tutorial <https://perf.wiki.kernel.org/index.php/Tutorial>`__
it_it: Esiste anche un utile tutorial su perf sul wiki di perf che approfondisce alcuni argomenti in modo più dettagliato rispetto a quanto facciamo qui: `perf Tutorial <https://perf.wiki.kernel.org/index.php/Tutorial>`__

source: Therefore, the default configuration in Poky corresponds to the below settings::
it_it: Pertanto, la configurazione di default in Poky corrisponde alle seguenti impostazioni:

source: Therefore, what you need to do in order to run a SystemTap script on the target is to 1) on the host system, compile the probe into a kernel module that makes sense to the target, 2) copy the module onto the target system and 3) insert the module into the target kernel, which arms it, and 4) collect the data generated by the probe and display it to the user.
it_it: Pertanto, per eseguire uno script SystemTap sul sistema target, è necessario procedere come segue: 1) sul sistema host, compilare la sonda in un modulo del kernel compatibile con il sistema target; 2) copiare il modulo sul sistema target; 3) inserire il modulo nel kernel del sistema target, abilitandolo; e 4) raccogliere i dati generati dalla sonda e visualizzarli all'utente.

source: Therefore, what you need to do is build an SDK image or image with ``tools-profile`` as detailed in the ":ref:`profile-manual/intro:General Setup`" section of this manual, and boot the resulting target image.
it_it: Pertanto, è necessario creare un'immagine SDK o un'immagine con ``tools-profile`` come descritto nella sezione ":ref:`profile-manual/intro:General Setup`" di questo manuale e avviare l'immagine di destinazione risultante.

source: These are exactly the same set of event filters defined by the trace event subsystem. See the ftrace / trace-cmd / KernelShark section for more discussion about these event filters.
it_it: Si tratta esattamente dello stesso set di filtri per eventi definito dal sottosistema di eventi di tracciamento. Per ulteriori informazioni su questi filtri, consultare la sezione ftrace / trace-cmd / KernelShark.

source: These are exactly the same set of events defined by the trace event subsystem and exposed by ftrace / trace-cmd / KernelShark as files in ``/sys/kernel/debug/tracing/events``, by SystemTap as kernel.trace("tracepoint_name") and (partially) accessed by LTTng.
it_it: Si tratta esattamente dello stesso set di eventi definito dal sottosistema degli eventi di tracciamento ed esposto da ftrace / trace-cmd / KernelShark come file in ``/sys/kernel/debug/tracing/events``, da SystemTap come kernel.trace("tracepoint_name") e (parzialmente) accessibile da LTTng.

source: These are the default shared state artifacts generated by the :term:`OpenEmbedded Build System`. They are not signed with GPG by default, so let's see how to add signing of these artifacts.
it_it: Questi sono gli artefatti di shared state predefiniti generati da :term:`OpenEmbedded Build System`. Non sono firmati con GPG per default, quindi vediamo come aggiungere la firma a questi artefatti.

source: These directories contain the ``*.bbclass`` files. Class files are used to abstract common code so it can be reused by multiple packages. Every package inherits the :ref:`ref-classes-base` file. Examples of other important classes are :ref:`ref-classes-autotools`, which in theory allows any Autotool-enabled package to work with the Yocto Project with minimal effort. Another example is :ref:`ref-classes-kernel` that contains common code and functions for working with the Linux kernel. Functions like image generation or packaging also have their specific class files such as :ref:`ref-classes-image`, :ref:`ref-classes-rootfs*` and :ref:`package*.bbclass <ref-classes-package>`.
it_it: Queste directory contengono i file ``*.bbclass``. I file di classe vengono utilizzati per astrarre il codice comune in modo che possa essere riutilizzato da più pacchetti. Ogni pacchetto eredita il file :ref:`ref-classes-base`. Esempi di altre classi importanti sono :ref:`ref-classes-autotools`, che in teoria consente a qualsiasi pacchetto abilitato per Autotools di funzionare con Yocto Project con il minimo sforzo. Un altro esempio è :ref:`ref-classes-kernel`, che contiene codice e funzioni comuni per lavorare con il kernel Linux. Funzioni come la generazione di immagini o il packaging hanno anch'esse i propri file di classe specifici, come :ref:`ref-classes-image`, :ref:`ref-classes-rootfs*` e :ref:`package*.bbclass <ref-classes-package>`.

source: These event filters are implemented by a special-purpose pseudo-interpreter in the kernel and are an integral and indispensable part of the perf design as it relates to tracing. kernel-based event filters provide a mechanism to precisely throttle the event stream that appears in user space, where it makes sense to provide bindings to real programming languages for post-processing the event stream. This architecture allows for the intelligent and flexible partitioning of processing between the kernel and user space. Contrast this with other tools such as SystemTap, which does all of its processing in the kernel and as such requires a special project-defined language in order to accommodate that design, or LTTng, where everything is sent to user space and as such requires a super-efficient kernel-to-user space transport mechanism in order to function properly. While perf certainly can benefit from for instance advances in the design of the transport, it doesn't fundamentally depend on them. Basically, if you find that your perf tracing application is causing buffer I/O overruns, it probably means that you aren't taking enough advantage of the kernel filtering engine.
it_it: Questi filtri sono implementati da uno pseudo-interprete dedicato nel kernel e rappresentano una parte integrante e indispensabile dell'architettura di perf per quanto riguarda il tracciamento. I filtri per eventi basati sul kernel forniscono un meccanismo per limitare con precisione il flusso di eventi che appare nello spazio utente, dove ha senso fornire binding a linguaggi di programmazione reali per l'elaborazione successiva del flusso di eventi. Questa architettura consente una partizione intelligente e flessibile dell'elaborazione tra il kernel e lo spazio utente. Si confronti questo approccio con altri strumenti come SystemTap, che esegue tutta l'elaborazione nel kernel e, come tale, richiede un linguaggio specifico definito dal progetto per adattarsi a tale architettura, o LTTng, dove tutto viene inviato allo spazio utente e, come tale, richiede un meccanismo di trasporto dal kernel allo spazio utente estremamente efficiente per funzionare correttamente. Sebbene perf possa certamente trarre vantaggio, ad esempio, da progressi nella progettazione del trasporto, non ne dipende fondamentalmente. In sostanza, se la propria applicazione di tracciamento delle prestazioni causa overflow del buffer I/O, probabilmente significa che non si sta sfruttando a sufficienza il motore di filtraggio del kernel.

source: These files define things such as the kernel package to use (:term:`PREFERRED_PROVIDER` of :ref:`virtual/kernel <dev-manual/new-recipe:using virtual providers>`), the hardware drivers to include in different types of images, any special software components that are needed, any bootloader information, and also any special image format requirements.
it_it: Questi file definiscono elementi come il pacchetto del kernel da utilizzare (:term:`PREFERRED_PROVIDER` di :ref:`virtual/kernel <dev-manual/new-recipe:using virtual providers>`), i driver hardware da includere nei diversi tipi di immagini, eventuali componenti software speciali necessari, informazioni sul bootloader e requisiti specifici per il formato dell'immagine.

source: These fragment values correspond to the choices made when running :ref:`bitbake:ref-bbsetup-command-init`.
it_it: Questi valori dei frammenti corrispondono alle scelte effettuate durante l'esecuzione di :ref:`bitbake:ref-bbsetup-command-init`.

source: These methods also include the ability to take a lockfile when manipulating shared state directory structures, for cases where file additions or removals are sensitive::
it_it: Questi metodi includono anche la possibilità di utilizzare un file di blocco durante la manipolazione delle strutture delle directory dello stato condiviso, per i casi in cui l'aggiunta o la rimozione di file è un'operazione delicata::

source: These milestone releases are tagged with a capital "M" after the future release tag name. For example, the milestone tags "6.1M1", "6.1M2", and "6.1M3" are released before the actual "6.1" release.
it_it: Queste release milestone sono contrassegnate da una "M" maiuscola dopo il nome della release futura. Ad esempio, le release milestone "6.1M1", "6.1M2" e "6.1M3" vengono rilasciate prima della release "6.1" vera e propria.

source: These optional files satisfy licensing requirements for the BSP. The type or types of files here can vary depending on the licensing requirements. For example, in the Raspberry Pi BSP, all licensing requirements are handled with the ``COPYING.MIT`` file.
it_it: Questi file opzionali soddisfano i requisiti di licenza per il BSP. Il tipo o i tipi di file qui presenti possono variare a seconda dei requisiti di licenza. Ad esempio, nel BSP per Raspberry Pi, tutti i requisiti di licenza sono gestiti dal file ``COPYING.MIT``.

source: These set up the environment similar to what was previously in the local configuration file :ref:`local.conf <structure-build-conf-local.conf>`, which is now largely empty. To set up the build how it was done previously, see the :doc:`/dev-manual/poky-manual-setup` section of the Yocto Project Development Tasks Manual.
it_it: Queste impostazioni configurano l'ambiente in modo simile a quanto precedentemente presente nel file di configurazione locale :ref:`local.conf <structure-build-conf-local.conf>`, che ora è in gran parte vuoto. Per configurare la build come in precedenza, consultare la sezione :doc:`/dev-manual/poky-manual-setup` del Manuale di Sviluppo dei Task di Yocto Project.

source: These settings will appear in the ``.gitconfig`` file in your home directory.
it_it: Queste impostazioni appariranno nel file ``.gitconfig`` nella propria directory home.

source: These statements define:
it_it: Queste dichiarazioni definiscono:

source: These tests are also run for stable and :term:`LTS` versions of the Yocto Project. See the :doc:`/ref-manual/release-process` section of the Yocto Project Reference Manual for more information on these types of releases.
it_it: Questi test vengono eseguiti anche per le versioni stabili e :term:`LTS` di Yocto Project. Per ulteriori informazioni su queste tipologie di rilascio, consultare la sezione :doc:`/ref-manual/release-process` del Manuale di Riferimento di Yocto Project.

source: These tracepoints and their representation are used not only by ftrace, but by many of the other tools covered in this document and they form a central point of integration for the various tracers available in Linux. They form a central part of the instrumentation for the following tools: perf, LTTng, ftrace, blktrace and SystemTap
it_it: Questi punti di tracciamento e la loro rappresentazione sono utilizzati non solo da ftrace, ma anche da molti altri strumenti trattati in questo documento e costituiscono un punto di integrazione centrale per i vari tracer disponibili in Linux. Sono parte integrante della strumentazione per i seguenti strumenti: perf, LTTng, ftrace, blktrace e SystemTap.

source: This ``From`` field is used by ``git am`` to recreate commits with the right author name. The following will ensure that your e-mails have an additional ``From`` field at the beginning of the Email body, and therefore that maintainers accepting your patches don't have to fix commit author information manually::
it_it: Questo campo ``From`` viene utilizzato da ``git am`` per ricreare i commit con il nome dell'autore corretto. Quanto segue garantirà che le e-mail abbiano un campo ``From`` aggiuntivo all'inizio del corpo dell'e-mail, in modo che i manutentori che accettano le patch non debbano correggere manualmente le informazioni sull'autore del commit::

source: This applies to multiple scenarios:
it_it: Questo si applica a diversi scenari:

source: This can be used by the recipients of the software to assess their exposure to license compliance and security vulnerability issues.
it_it: Questo documento può essere utilizzato dai destinatari del software per valutare la propria esposizione a problemi di conformità delle licenze e vulnerabilità di sicurezza.

source: This category may be applicable as support/usage in an area develops and grows, or as support/usage fades but we continue to have tests. It can also apply where resourcing isn't available for full primary support but there is member/maintainer support for running tests.
it_it: Questa categoria può essere applicabile quando il supporto/l'utilizzo in un'area si sviluppa e cresce, oppure quando il supporto/l'utilizzo diminuisce ma continuiamo ad avere test. Può anche essere applicabile quando non sono disponibili risorse per un supporto primario completo, ma vi è il supporto di membri/manutentori per l'esecuzione dei test.

source: This chapter contains real-world examples.
it_it: Questo capitolo contiene esempi pratici.

source: This chapter describes how you need to prepare your system in order to use Toaster.
it_it: Questo capitolo descrive come preparare il sistema per utilizzare Toaster.

source: This chapter discusses only the most useful and important classes. Other classes do exist within the ``meta/classes*`` directories of :term:`OpenEmbedded-Core (OE-Core)`. You can refer to the ``.bbclass`` files directly for more information.
it_it: Questo capitolo tratta solo le classi più utili e importanti. Esistono altre classi all'interno delle directory ``meta/classes*`` di :term:`OpenEmbedded-Core (OE-Core)`. Per ulteriori informazioni, è possibile consultare direttamente i file ``.bbclass``.

source: This chapter lists common variables used in the OpenEmbedded build system and gives an overview of their function and contents.
it_it: Questo capitolo elenca le variabili comuni utilizzate nel sistema di build OpenEmbedded e fornisce una panoramica della loro funzione e del loro contenuto.

source: This chapter presents basic usage examples for each of the tracing tools.
it_it: Questo capitolo presenta esempi di utilizzo di base per ciascuno dei tool di tracing.

source: This chapter provides explanations for Yocto Project concepts that go beyond the surface of "how-to" information and reference (or look-up) material. Concepts such as components, the :term:`OpenEmbedded Build System` workflow, cross-development toolchains, shared state cache, and so forth are explained.
it_it: Questo capitolo fornisce spiegazioni sui concetti di Yocto Project che vanno oltre le semplici istruzioni pratiche e il materiale di riferimento. Vengono illustrati concetti come i componenti, il :term:`OpenEmbedded Build System` workflow, le toolchain di "cross-development", la cache di stato condivisa [shared] e così via.

source: This chapter takes a look at the Yocto Project development environment. The chapter provides Yocto Project Development environment concepts that help you understand how work is accomplished in an open source environment, which is very different as compared to work accomplished in a closed, proprietary environment.
it_it: Questo capitolo esamina l'ambiente [environment] di sviluppo di Yocto Project. Il capitolo fornisce concetti relativi all'ambiente di sviluppo di Yocto Project che aiutano a comprendere come si lavora in un ambiente open source, che è molto diverso rispetto al lavoro svolto in un ambiente proprietario chiuso.

source: This configuration file contains the local user configurations for the build environment.
it_it: Questo file contiene le configurazioni utente locali per l'ambiente di build.

source: This configuration file contains the site specific configurations for your build environment.
it_it: Questo file contiene le configurazioni specifiche del sito per l'ambiente di build [compilazione].

source: This configuration file could also include a hardware "tuning" file that is commonly used to define the package architecture and specify optimization flags, which are carefully chosen to give best performance on a given processor.
it_it: Questo file di configurazione potrebbe includere anche un file di "tuning" hardware, comunemente utilizzato per definire l'architettura del pacchetto e specificare i flag di ottimizzazione, scelti con cura per ottenere le migliori prestazioni su un determinato processore.

source: This configuration file defines :ref:`layers <dev-manual/layers:understanding and creating layers>`, which are directory trees, traversed (or walked) by BitBake. The :ref:`structure-build-conf-bblayers.conf` file uses the :term:`BBLAYERS` variable to list the layers BitBake tries to find.
it_it: Questo file di configurazione definisce i :ref:`layer <dev-manual/layers:understanding and creating layers>`, ovvero le strutture ad albero delle directory attraversate (o percorse) da BitBake. Il file :ref:`structure-build-conf-bblayers.conf` utilizza la variabile :term:`BBLAYERS` per elencare i layer che BitBake cerca.

source: This configuration file is generated by :doc:`bblock </dev-manual/bblock>` and contains the signatures locked by ``bblock``. By default, it does not exist and will be created upon the first invocation of ``bblock``.
it_it: Questo file di configurazione viene generato da :doc:`bblock </dev-manual/bblock>` e contiene le firme bloccate da ``bblock``. Per default, non esiste e verrà creato alla prima esecuzione di ``bblock``.

source: This cpio archive can either be loaded to RAM by the bootloader, or be included in the kernel binary.
it_it: Questo archivio cpio può essere caricato nella RAM dal bootloader oppure incluso nel binario del kernel.

source: This directory adds additional recipes and append files used by the OpenEmbedded selftests to verify the behavior of the build system. You do not have to add this layer to your :ref:`structure-build-conf-bblayers.conf` file unless you want to run the selftests.
it_it: Questa directory aggiunge ricette e file append aggiuntivi utilizzati dagli autotest di OpenEmbedded per verificare il comportamento del sistema di compilazione. Non è necessario aggiungere questo layer al file :ref:`structure-build-conf-bblayers.conf` a meno che non si desideri eseguire gli autotest.

source: This directory also contains a ``README``, describing the current configuration and showing some instructions.
it_it: Questa directory contiene anche un file ``README``, che descrive la configurazione corrente e fornisce alcune istruzioni.

source: This directory contains JSON files in :term:`SPDX` format which are used to create a Software Bill of Materials (:term:`SBOM`), as explained in detail in the ":ref:`dev-manual/sbom:creating a software bill of materials`" section of the Yocto Project Development Tasks Manual.
it_it: Questa directory contiene file JSON in formato :term:`SPDX` utilizzati per creare una Software Bill of Materials (:term:`SBOM`) [distinta base], come spiegato in dettaglio nella sezione ":ref:`dev-manual/sbom:creating a software bill of materials`" del Manuale di Sviluppo dei Task di Yocto Project.

source: This directory contains OpenEmbedded Python library code used during the build process. It is enabled via the ``addpylib`` directive in ``meta/conf/layer.conf``. For more information, see :ref:`bitbake-user-manual/bitbake-user-manual-metadata:extending python library code`.
it_it: Questa directory contiene il codice della libreria Python di OpenEmbedded utilizzato durante il processo di build. È abilitato tramite la direttiva ``addpylib`` nel file ``meta/conf/layer.conf``. Per ulteriori informazioni, consultare :ref:`bitbake-user-manual/bitbake-user-manual-metadata:extending python library code`.

source: This directory contains X and other graphically related system libraries.
it_it: Questa directory contiene X e altre librerie di sistema relative alla grafica.

source: This directory contains a list of cached results for various architectures. Because certain "autoconf" test results cannot be determined when cross-compiling due to the tests not able to run on a live system, the information in this directory is passed to "autoconf" for the various architectures.
it_it: Questa directory contiene un elenco di risultati memorizzati nella cache per diverse architetture. Poiché alcuni risultati dei test di "autoconf" non possono essere determinati durante la cross-compilazione, in quanto i test non sono eseguibili su un sistema live, le informazioni contenute in questa directory vengono passate ad "autoconf" per le diverse architetture.

source: This directory contains all the machine configuration files. If you set ``MACHINE = "qemux86"``, the OpenEmbedded build system looks for a ``qemux86.conf`` file in this directory. The ``include`` directory contains various data common to multiple machines. If you want to add support for a new machine to the Yocto Project, look in this directory.
it_it: Questa directory contiene tutti i file di configurazione della macchina. Se si imposta ``MACHINE = "qemux86"``, il sistema di build OpenEmbedded cerca il file ``qemux86.conf`` in questa directory. La directory ``include`` contiene vari dati comuni a diverse macchine. Per aggiungere il supporto per una nuova macchina a Yocto Project, consultare questa directory.

source: This directory contains all things related to the GTK+ application framework.
it_it: Questa directory contiene tutto ciò che riguarda il framework applicativo GTK+.

source: This directory contains any "end result" output from the OpenEmbedded build process. The :term:`DEPLOY_DIR` variable points to this directory. For more detail on the contents of the ``deploy`` directory, see the ":ref:`overview-manual/concepts:images`" and ":ref:`overview-manual/concepts:application development sdk`" sections in the Yocto Project Overview and Concepts Manual.
it_it: Questa directory contiene tutti gli "end result" [risultati finali] del processo di build di OpenEmbedded. La variabile :term:`DEPLOY_DIR` punta a questa directory. Per maggiori dettagli sul contenuto della directory ``deploy``, consultare le sezioni ":ref:`overview-manual/concepts:images`" e ":ref:`overview-manual/concepts:application development sdk`" nel Manuale Introduttivo e Concetti di Yocto Project.

source: This directory contains anything linking to specific hardware or hardware configuration information such as "u-boot" and "grub".
it_it: Questa directory contiene tutti i collegamenti a hardware specifici o informazioni di configurazione hardware, come "u-boot" e "grub".
